relatorio_resumo_performance.txt
     █ 0. Preparação (Criar Favorecido)

     █ 1. Fluxo de Cadastro (POST /users/register)

       ✓ Cadastro - Status 201

     █ 2. Fluxo de Login (POST /users/login)

       ✓ Login - Status 200 OK
       ✓ Login - Token presente

     █ 3. Fluxo de Transferência (POST /transfers)

       ✓ Transferência - Status 201

     █ Simulando o pensamento do usuário

   ✓ checks.........................: 100.00% ✓ 764       ✗ 0    
     data_received..................: 290 kB  12 kB/s
     data_sent......................: 197 kB  7.8 kB/s
     group_duration.................: avg=1.78s       min=29.2ms  med=1.79s     max=6.06s    p(90)=2.98s     p(95)=3.2s    
     http_req_blocked...............: avg=169.72µs    min=0s      med=0s        max=4.48ms   p(90)=798.14µs  p(95)=1.28ms  
     http_req_connecting............: avg=140.7µs     min=0s      med=0s        max=3.42ms   p(90)=699.02µs  p(95)=1.15ms  
   ✗ http_req_duration..............: avg=1.98s       min=28.63ms med=2.1s      max=6.06s    p(90)=3.04s     p(95)=3.25s   
       { expected_response:true }...: avg=1.98s       min=28.63ms med=2.1s      max=6.06s    p(90)=3.04s     p(95)=3.25s   
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 764  
     http_req_receiving.............: avg=1.09ms      min=0s      med=467.4µs   max=10.43ms  p(90)=3.13ms    p(95)=5.43ms  
     http_req_sending...............: avg=59.78µs     min=0s      med=0s        max=893.3µs  p(90)=0s        p(95)=594.86µs
     http_req_tls_handshaking.......: avg=0s          min=0s      med=0s        max=0s       p(90)=0s        p(95)=0s      
     http_req_waiting...............: avg=1.98s       min=24.34ms med=2.09s     max=6.05s    p(90)=3.04s     p(95)=3.24s   
     http_reqs......................: 764     30.400163/s
     iteration_duration.............: avg=8.95s       min=1.16s   med=9.54s     max=13.53s   p(90)=12.14s    p(95)=12.67s  
     iterations.....................: 191     7.600041/s
   ✗ taxa_login_duration............: avg=1914.991556 min=28.6349 med=2108.2458 max=3239.167 p(90)=2866.3462 p(95)=2969.038
     vus............................: 42      min=0       max=100
     vus_max........................: 100     min=80      max=100