relatorio_resumo_performance.txt
     █ 0. Preparação (Criar Favorecido)

     █ 1. Fluxo de Cadastro (POST /users/register)

       ✓ Cadastro - Status 201

     █ 2. Fluxo de Login (POST /users/login)

       ✓ Login - Status 200 OK
       ✓ Login - Token presente

     █ 3. Fluxo de Transferência (POST /transfers)

       ✓ Transferência - Status 201

     █ Simulando o pensamento do usuário

   ✓ checks.........................: 100.00% ✓ 1232      ✗ 0    
     data_received..................: 469 kB  22 kB/s
     data_sent......................: 318 kB  15 kB/s
     group_duration.................: avg=888.78ms   min=994.9µs  med=1s       max=2.69s     p(90)=1.35s      p(95)=1.42s      
     http_req_blocked...............: avg=115.35µs   min=0s       med=0s       max=66.94ms   p(90)=0s         p(95)=534.25µs   
     http_req_connecting............: avg=41.92µs    min=0s       med=0s       max=2.8ms     p(90)=0s         p(95)=508.7µs    
   ✓ http_req_duration..............: avg=859.22ms   min=994.9µs  med=904.3ms  max=2.69s     p(90)=1.39s      p(95)=1.43s      
       { expected_response:true }...: avg=859.22ms   min=994.9µs  med=904.3ms  max=2.69s     p(90)=1.39s      p(95)=1.43s      
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 1232 
     http_req_receiving.............: avg=696.89µs   min=0s       med=0s       max=29.12ms   p(90)=2.09ms     p(95)=3.91ms     
     http_req_sending...............: avg=36.27µs    min=0s       med=0s       max=5.17ms    p(90)=0s         p(95)=0s         
     http_req_tls_handshaking.......: avg=0s         min=0s       med=0s       max=0s        p(90)=0s         p(95)=0s         
     http_req_waiting...............: avg=858.49ms   min=508.29µs med=904.15ms max=2.69s     p(90)=1.39s      p(95)=1.43s      
     http_reqs......................: 1232    57.608536/s
     iteration_duration.............: avg=4.44s      min=1.06s    med=4.67s    max=7.07s     p(90)=6.29s      p(95)=6.4s       
     iterations.....................: 308     14.402134/s
   ✓ taxa_login_duration............: avg=850.605954 min=13.7005  med=907.461  max=1492.7956 p(90)=1361.74653 p(95)=1428.227495
     vus............................: 25      min=0       max=100
     vus_max........................: 100     min=100     max=100